outpaddling/SPCM/FreeBSD/Man/spcm-run.mdoc
.\" MDOC man page template
.\" Use MDOC only for system-specific man pages where groff is the
.\" default nroff command.  For portable software meant to run on
.\" all *nix platforms, use the older MAN format.  ( *.man in APE )
.Dd 2011-11-03  
.Dt CLUSTER-RUN 1
.Os
.\"----------------------------------------------------------------------
.Sh NAME
.Nm spcm-run
.Nd run a command on all cluster nodes
.\"----------------------------------------------------------------------
.Sh SYNOPSIS
.Nm
.Op --parallel
.Ar 'command'
.\"----------------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
command runs the same command on all compute nodes, but not the head node.
.Pp
The command must be enclosed in single (hard) quotes to avoid expansion
before being passed to each compute node.
.Pp
.Nm
is primarily called by other cluster tools such as spcm-pkg_add, but is
documented for cases where more flexibility is needed.  It should be used
with extreme caution.
.Pp
The following options are available:
.\" ~~~~~~~~~~~~~~~~ Begin list
.Bl -tag -width indent
.It Fl --parallel
Run the command on all hosts at once, saving standard output and standard
error to files corresponding to the hostname of each node.
.El                     
.\" ~~~~~~~~~~~~~~~~ End list
.\"----------------------------------------------------------------------
.Sh EXIT STATUS
.Ex -std
.\"----------------------------------------------------------------------
.Sh SEE ALSO
.Xr spcm-adduser
.Xr spcm-admin
.Xr spcm-cp
.Xr spcm-update-ssh_config
.Xr spcm-pkg_add
.Xr spcm-port_add
.Xr spcm-rmuser
.Xr spcm-setup
.Xr spcm-shutdown
.\"----------------------------------------------------------------------
.Sh HISTORY
The
.Nm
command first appeared as part of the spcm-admin port in FreeBSD 8.2.
.At v7 .
.\"----------------------------------------------------------------------
.Sh AUTHORS
.An Jason Bacon                             
.\"----------------------------------------------------------------------
.Sh BUGS
Yes.
