outpaddling/SPCM/FreeBSD/Man/spcm-admin.mdoc
.\" MDOC man page template
.\" Use MDOC only for system-specific man pages where groff is the
.\" default nroff command.  For portable software meant to run on
.\" all *nix platforms, use the older MAN format.  ( *.man in APE )
.Dd 2011-11-03  
.Dt CLUSTER-ADMIN 1
.Os
.\"----------------------------------------------------------------------
.Sh NAME
.Nm spcm-admin
.Nd cluster administration menu
.\"----------------------------------------------------------------------
.Sh SYNOPSIS
.Nm
.\"----------------------------------------------------------------------
.Sh PURPOSE
The
.Nm
command presents a simple text menu for cluster administration commands
included in the spcm-admin port.
.\"----------------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
command presents a menu of cluster administration tasks corresponding
to spcm-admin commands such as spcm-adduser, spcm-run, etc.
.\"
.\"----------------------------------------------------------------------
.Sh EXIT STATUS
.Ex -std
.\"----------------------------------------------------------------------
.Sh SEE ALSO
.Xr spcm-cp
.Xr spcm-update-ssh_config
.Xr spcm-pkg_add
.Xr spcm-port_add
.Xr spcm-rmuser
.Xr spcm-run
.Xr spcm-setup
.Xr spcm-shutdown
.\"----------------------------------------------------------------------
.Sh HISTORY
The
.Nm
command first appeared as a port in FreeBSD 8.2.
.\"----------------------------------------------------------------------
.Sh AUTHORS
.An "Jason W. Bacon"
.\"----------------------------------------------------------------------
.Sh BUGS
Yes.
