outpaddling/SPCM/FreeBSD/Man/spcm-pkg_add.mdoc
.\" MDOC man page template
.\" Use MDOC only for system-specific man pages where groff is the
.\" default nroff command.  For portable software meant to run on
.\" all *nix platforms, use the older MAN format.  ( *.man in APE )
.Dd 2011-11-03  
.Dt CLUSTER-PKG_ADD 1
.Os
.\"----------------------------------------------------------------------
.Sh NAME
.Nm spcm-pkg_add
.Nd install a package on compute nodes
.\"----------------------------------------------------------------------
.Sh SYNOPSIS
.\" Form 1
.Nm
.Ar package-name
.\"----------------------------------------------------------------------
.Sh DESCRIPTION
The
.Nm
command installs a package on all compute nodes using
"pkg_add -r package-name".
.Pp
.Sh ENVIRONMENT
Since
.Nm
runs pkg_add, see the environment section of the pkg_add man page.
.\"----------------------------------------------------------------------
.Sh EXIT STATUS
.Ex -std
.\"----------------------------------------------------------------------
.Sh SEE ALSO
.Xr pkg_add
.Xr spcm-adduser
.Xr spcm-admin
.Xr spcm-cp
.Xr spcm-update-ssh_config
.Xr spcm-port_add
.Xr spcm-rmuser
.Xr spcm-run
.Xr spcm-setup
.Xr spcm-shutdown
.\"----------------------------------------------------------------------
.\"----------------------------------------------------------------------
.Sh HISTORY
The
.Nm
command first appeared as part of the spcm-admin port in FreeBSD 8.2.
.\"----------------------------------------------------------------------
.Sh AUTHORS
.An Jason Bacon                             
.\"----------------------------------------------------------------------
.Sh BUGS
Yes.
